import os
import pytest
from main import parse_args, read_data, calculate_averages, sort_by_grade
def create_test_files():
    with open("students1.csv", "w", encoding="utf-8") as f1:
        f1.write("""student_name,subject,teacher_name,date,grade
Семенова Елена,Английский язык,Ковалева Анна,2023-10-10,5
Титов Владислав,География,Орлов Сергей,2023-10-12,4
Власова Алина,Биология,Ткаченко Наталья,2023-10-15,5
Белов Станислав,Литература,Белова Светлана,2023-10-18,4
Дорофеев Никита,История,Морозов Дмитрий,2023-10-20,3
Калинина Ольга,Английский язык,Ковалева Анна,2023-10-22,5
Максимов Кирилл,География,Орлов Сергей,2023-10-25,4
Игнатьев Роман,Математика,Петрова Ольга,2023-10-28,5
Савельева Анастасия,Физика,Сидоров Иван,2023-11-01,4
Гусев Артур,Информатика,Козлов Андрей,2023-11-03,3
Миронова Вероника,Химия,Васильева Елена,2023-11-05,5
Кудрявцев Глеб,Математика,Петрова Ольга,2023-11-08,4
Орлова Дарья,Физика,Сидоров Иван,2023-11-10,5
Жуков Александр,Информатика,Козлов Андрей,2023-11-12,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,3
Степанов Игорь,Биология,Ткаченко Наталья,2023-11-18,5
Чернова Виталина,Литература,Белова Светлана,2023-11-20,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,5""")
    with open("students2.csv", "w", encoding="utf-8") as f2:
        f2.write("""student_name,subject,teacher_name,date,grade
Семенова Елена,Английский язык,Ковалева Анна,2023-10-10,5
Титов Владислав,География,Орлов Сергей,2023-10-12,4
Власова Алина,Биология,Ткаченко Наталья,2023-10-15,5
Белов Станислав,Литература,Белова Светлана,2023-10-18,4
Дорофеев Никита,История,Морозов Дмитрий,2023-10-20,3
Калинина Ольга,Английский язык,Ковалева Анна,2023-10-22,5
Максимов Кирилл,География,Орлов Сергей,2023-10-25,4
Игнатьев Роман,Математика,Петрова Ольга,2023-10-28,5
Савельева Анастасия,Физика,Сидоров Иван,2023-11-01,4
Гусев Артур,Информатика,Козлов Андрей,2023-11-03,3
Миронова Вероника,Химия,Васильева Елена,2023-11-05,5
Кудрявцев Глеб,Математика,Петрова Ольга,2023-11-08,4
Орлова Дарья,Физика,Сидоров Иван,2023-11-10,5
Жуков Александр,Информатика,Козлов Андрей,2023-11-12,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,3
Степанов Игорь,Биология,Ткаченко Наталья,2023-11-18,5
Чернова Виталина,Литература,Белова Светлана,2023-11-20,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,5""")
    with open("students1copy.csv", "w", encoding="utf-8") as f3:
        f3.write("""""")
    
def remove_test_files():
    files = ["students1copy.csv", "students1.csv", "students2.csv"]
    for file in files:
        os.remove(file)

def test_parse_args_valid():
    create_test_files()

    args = parse_args(["--files", "students1.csv", "--report", "File.csv"])
    assert args.files is not None
    
    for file in args.files:
        file.close()

    args = parse_args(["--files", "students1.csv", "students2.csv", "students1copy.csv", "--report", "File.csv"])
    assert args.files is not None
    
    for file in args.files:
        file.close()

    remove_test_files()

def test_parse_args_invalid():
    create_test_files()
    try:

        with pytest.raises(SystemExit):
            parse_args(["--zasdas", "students1.csv", "students2.csv", "students1copy.csv", "--report", "File.csv"])
    
        with pytest.raises(SystemExit):
            parse_args([])
        
        with pytest.raises(SystemExit):
            parse_args(["--files"])

    finally:
        remove_test_files()

def test_read_data_empty_value():
    with open("students1.csv", "w", encoding="utf-8") as f1:
        f1.write("""student_name,subject,teacher_name,date,grade
Семенова Елена,Английский язык,Ковалева Анна,2023-10-10,
Титов Владислав,География,Орлов Сергей,2023-10-12,4
Власова Алина,Биология,Ткаченко Наталья,2023-10-15,5
Белов Станислав,Литература,Белова Светлана,2023-10-18,4
Дорофеев Никита,История,Морозов Дмитрий,2023-10-20,3
Калинина Ольга,Английский язык,Ковалева Анна,2023-10-22,
Максимов Кирилл,География,Орлов Сергей,2023-10-25,4
Игнатьев Роман,Математика,Петрова Ольга,2023-10-28,5
Савельева Анастасия,Физика,Сидоров Иван,2023-11-01,4
Гусев Артур,Информатика,Козлов Андрей,2023-11-03,3
Миронова Вероника,Химия,Васильева Елена,2023-11-05,5
Кудрявцев Глеб,Математика,Петрова Ольга,2023-11-08,4
Орлова Дарья,Физика,Сидоров Иван,2023-11-10,5
Жуков Александр,Информатика,Козлов Андрей,2023-11-12,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,3
Степанов Игорь,Биология,Ткаченко Наталья,2023-11-18,5
Чернова Виталина,Литература,Белова Светлана,2023-11-20,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,5""")
    args = parse_args(["--files", "students1.csv", "--report", "File.csv"])
    with pytest.raises(SystemError):
        read_data(args)
    for file in args.files:
        file.close()
    for file in args.report:
        file.close()
    os.remove("students1.csv")
    os.remove("File.csv")

def test_read_data_invalid_file_data():
    with open("students1.csv", "w", encoding="utf-8") as f1:
        f1.write("""0""")
    args = parse_args(["--files", "students1.csv", "--report", "File.csv"])
    with pytest.raises(TypeError):
        read_data(args)
    for file in args.files:
        file.close()
    for file in args.report:
        file.close()
    os.remove("students1.csv")
    os.remove("File.csv")

def test_calculate_averages_non_mark_value():
    with open("students1.csv", "w", encoding="utf-8") as f1:
        f1.write("""student_name,subject,teacher_name,date,grade
Семенова Елена,Английский язык,Ковалева Анна,2023-10-10,8
Титов Владислав,География,Орлов Сергей,2023-10-12,4
Власова Алина,Биология,Ткаченко Наталья,2023-10-15,5
Белов Станислав,Литература,Белова Светлана,2023-10-18,-48
Дорофеев Никита,История,Морозов Дмитрий,2023-10-20,3
Калинина Ольга,Английский язык,Ковалева Анна,2023-10-22,90
Максимов Кирилл,География,Орлов Сергей,2023-10-25,4
Игнатьев Роман,Математика,Петрова Ольга,2023-10-28,5
Савельева Анастасия,Физика,Сидоров Иван,2023-11-01,4
Гусев Артур,Информатика,Козлов Андрей,2023-11-03,3
Миронова Вероника,Химия,Васильева Елена,2023-11-05,5
Кудрявцев Глеб,Математика,Петрова Ольга,2023-11-08,4
Орлова Дарья,Физика,Сидоров Иван,2023-11-10,5
Жуков Александр,Информатика,Козлов Андрей,2023-11-12,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,3
Степанов Игорь,Биология,Ткаченко Наталья,2023-11-18,5
Чернова Виталина,Литература,Белова Светлана,2023-11-20,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,4
Фомина Ксения,Химия,Васильева Елена,2023-11-15,5""")
    args = parse_args(["--files", "students1.csv", "--report", "File.csv"])
    data = read_data(args)
    with pytest.raises(SystemError):
        calculate_averages(data)
    for file in args.files:
        file.close()
    for file in args.report:
        file.close()
    os.remove("students1.csv")
    os.remove("File.csv")
